In [1]:
import pandas as pd

In [2]:
data = {
    "names":['a','b','c'],
    "ages":[25,28,21]
}

df = pd.DataFrame(data)
df

  names  ages
0     a    25
1     b    28
2     c    21

In [3]:
df.head(2)

  names  ages
0     a    25
1     b    28

In [4]:
df.describe()

            ages
count   3.000000
mean   24.666667
std     3.511885
min    21.000000
25%    23.000000
50%    25.000000
75%    26.500000
max    28.000000

In [5]:
df.columns=['emp_name','age']
df

  emp_name  age
0        a   25
1        b   28
2        c   21

In [6]:
df2=df.rename(columns={"emp_name": "emp_firstname", "age": "emp_age"})
df2

  emp_firstname  emp_age
0             a       25
1             b       28
2             c       21

In [7]:
dept= ["Sales", "Marketing", "IT"]

In [8]:
df2=df2.assign(Company=dept)

In [9]:
df2.dtypes

emp_firstname    object
emp_age           int64
Company          object
dtype: object

In [10]:
df3= df2.convert_dtypes()

In [11]:
df3.dtypes

emp_firstname    string
emp_age           Int64
Company          string
dtype: object

In [12]:
df4= df2.astype({"emp_age": float})
df4.dtypes

emp_firstname     object
emp_age          float64
Company           object
dtype: object

In [13]:
## number of rows and columns in df
df2.shape

(3, 3)

In [14]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }

In [15]:
index_label=['r1','r2','r3','r4','r5']

In [16]:
techdf= pd.DataFrame(technologies, index= index_label)
techdf

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

df.loc[start:stop:step, start:stop:step]
        select rows      select columns

In [17]:
techdf.loc['r1']

Courses     Spark
Fee         20000
Duration    30day
Discount     1000
Name: r1, dtype: object

In [18]:
techdf.loc[['r1','r2']]

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300

In [19]:
techdf.loc[:,["Courses"]]

    Courses
r1    Spark
r2  PySpark
r3   Hadoop
r4   Python
r5   pandas

In [20]:
techdf.loc["r2":"r4"]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [21]:
techdf.loc[techdf["Fee"]==22000]

   Courses    Fee Duration  Discount
r4  Python  22000   40days      2500

In [22]:
techdf.query("Courses =='PySpark'")

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300

In [23]:
newdf=techdf.drop(["Discount"], axis=1)
newdf

    Courses    Fee Duration
r1    Spark  20000    30day
r2  PySpark  25000   40days
r3   Hadoop  26000   35days
r4   Python  22000   40days
r5   pandas  24000   60days

In [24]:
emp_df= pd.read_csv("employee.csv")

In [25]:
emp= emp_df.convert_dtypes()
emp.dtypes

First Name            string
Gender                string
Start Date            string
Last Login Time       string
Salary                 Int64
Bonus %              Float64
Senior Management    boolean
Team                  string
dtype: object

In [26]:
emp["Start Date"]= pd.to_datetime(emp["Start Date"])

In [27]:
emp.dtypes

First Name                   string
Gender                       string
Start Date           datetime64[ns]
Last Login Time              string
Salary                        Int64
Bonus %                     Float64
Senior Management           boolean
Team                         string
dtype: object

In [28]:
emp.nunique()

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64

In [29]:
emp.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [30]:
emp["Gender"].fillna("no gender", inplace= True)

In [31]:
emp.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
dtype: int64

In [32]:
emp.groupby("Gender").count()
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.17,True,<NA>
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.34,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,no gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales

In [33]:
emp["Senior Management"].fillna(emp["Senior Management"].mode()[0], inplace=True)
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.17,True,<NA>
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.34,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,no gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales

In [34]:
emp.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management     0
Team                 43
dtype: int64

In [35]:
emp.to_csv("final_emp_df.csv")